0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000; 

boundaryField
{
    sides
    {
        type            zeroGradient;
    }
inlet
    {
        type            zeroGradient;
    }
/*    inlet
    {
        type            fixedValue;
        value           uniform 100000;
    }*/
    outlet
    {
        type            zeroGradient;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
