constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    sides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       11680;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       12280;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       12300;
    }
    empty
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12000;
        startFace       12320;
    }
)

// ************************************************************************* //
